[
    {
      "title": "ShotWatch",
      "year": "2025",
      "image": "https://vis-society.github.io/labs/2/images/empty.svg",
      "description": "Developed a full-stack application using AWS Lambda and GraphQL to enable advanced search queries across 615K+ NBA plays, allowing users to filter by shot location, quarter time, and additional play details effortlessly."
    },
    {
      "title": "League of Legends Performance Modeling",
      "year": "2024",
      "image": "https://vis-society.github.io/labs/2/images/empty.svg",
      "description": "Implemented a Random Forest classifier model to predict player roles from player performance stats from a dataset of 123,223 games, achieving a 95% F1-score through feature engineering and hyperparameter optimization."
    },
    {
      "title": "Cold Outreach Automation",
      "year": "2023",
      "image": "https://vis-society.github.io/labs/2/images/empty.svg",
      "description": "Developed an automated outreach system using nodriver and pandas scraping 100+ Wellfound job listings daily, extracting contacts from Apollo, and automating email outreach, reducing manual effort by 90%."
    },
    {
      "title": "Debitis aliquam recusandae animi.",
      "year": "2023",
      "image": "https://vis-society.github.io/labs/2/images/empty.svg",
      "description": "Ipsa iure qui saepe ab eveniet repellendus dolores expedita, recusandae non quisquam aperiam exercitationem alias enim doloribus, maxime aliquid hic a aspernatur corporis! Ab eveniet eaque saepe, corrupti mollitia autem!"
    },
    {
      "title": "Consequatur, quas? Exercitationem, itaque.",
      "year": "2025",
      "image": "https://vis-society.github.io/labs/2/images/empty.svg",
      "description": "Facilis culpa ut enim hic tenetur illum aperiam. In illo iste facere ut earum necessitatibus veniam ratione sed, recusandae blanditiis quisquam dicta laudantium aliquam autem, odit assumenda dolorum! Rem, repellendus!"
    },
    {
      "title": "Officia, fuga? Eum, odit.",
      "year": "2021",
      "image": "https://vis-society.github.io/labs/2/images/empty.svg",
      "description": "Harum, optio sapiente praesentium corporis fugiat quam dolorum nemo tempore debitis veritatis? Earum ea dignissimos nesciunt repellendus est animi vel sequi magni id quia, illum labore, rerum distinctio nobis ad?"
    },
    {
      "title": "Sed totam repellat repellendus?",
      "year": "2022",
      "image": "https://vis-society.github.io/labs/2/images/empty.svg",
      "description": "Recusandae, consectetur. Eaque voluptate nihil vero earum quas mollitia harum, blanditiis obcaecati, eum ipsa expedita unde accusantium labore ab ducimus nisi. Voluptas, sequi iste. Optio eaque expedita repellat soluta consequatur!"
    },
    {
      "title": "Quidem sint iste molestias.",
      "year": "2021",
      "image": "https://vis-society.github.io/labs/2/images/empty.svg",
      "description": "Culpa dolorem fugit non. Vero commodi sit quod pariatur optio enim sint eius neque maxime id quisquam quibusdam nesciunt illum atque, facere aliquid nam dolore eveniet eaque natus totam porro!"
    },
    {
      "title": "Quam quasi autem deleniti?",
      "year": "2025",
      "image": "https://vis-society.github.io/labs/2/images/empty.svg",
      "description": "Cumque perferendis at quisquam earum accusantium aliquid? Quisquam ea dicta corrupti illum? Illo inventore minus, dignissimos velit quam modi officia ex sunt, magnam labore nostrum facere natus quisquam cum laborum."
    },
    {
      "title": "Quae quis minima dolor?",
      "year": "2022",
      "image": "https://vis-society.github.io/labs/2/images/empty.svg",
      "description": "Beatae magnam accusamus earum possimus eius molestiae ex, molestias sapiente, quam esse officia blanditiis illo minus vero tempore quaerat enim dignissimos voluptas asperiores id iure a dolorem repellendus pariatur! Molestias!"
    },
    {
      "title": "Deleniti, provident! Consequatur, repudiandae.",
      "year": "2024",
      "image": "https://vis-society.github.io/labs/2/images/empty.svg",
      "description": "Esse quisquam eius sed nulla voluptates dolores possimus laboriosam voluptatem pariatur maxime debitis reprehenderit soluta consequuntur perspiciatis nihil ducimus, non, ea dolorum. At eius molestias dignissimos in voluptatum quas explicabo."
    },
    {
      "title": "Fugiat exercitationem adipisci corporis?",
      "year": "2023",
      "image": "https://vis-society.github.io/labs/2/images/empty.svg",
      "description": "Illum consectetur illo porro molestias molestiae neque ipsam dicta ex aut inventore, adipisci ducimus ad velit quas alias delectus sed at. Nulla commodi repellendus, at porro nisi fugiat culpa itaque."
    }
  ]